app/Controllers/Admin.php

    public function courses()
    {
        $model = new CourseModel();
        $data['courses'] = $model->findAll();
---
SELECT *
FROM `courses`

    public function editCourse($id)
    {
        $model = new CourseModel();
        $data['course'] = $model->find($id);
---
SELECT *
FROM `courses`
WHERE `courses`.`id` = '7'

    public function students()
    {
        $model = new MahasiswaModel();
        $data['students'] = $model->findAll();
---
SELECT *
FROM `mahasiswa`

    public function deleteStudent($id)
    {
        $model = new MahasiswaModel();
        if (!$model->find($id)) {
            return redirect()->to('/admin/students')->with('error', 'Mahasiswa tidak ditemukan');
        }
        $model->delete($id);
---
SELECT *
FROM `mahasiswa`
WHERE `mahasiswa`.`id` = '4'
DELETE FROM `mahasiswa`
WHERE `id` IN ('4')