app/Controllers/Auth.php

SELECT *
FROM `users`
WHERE `username` = '072'
 LIMIT 1
SELECT *
FROM `mahasiswa`
WHERE `NIM` = '072'
 LIMIT 1
---
    public function login()
    {
        $session = session();
        $userModel = new UserModel();
        $mahasiswaModel = new MahasiswaModel();

        $usernameOrNIM = $this->request->getPost('username');
        $password = $this->request->getPost('password');

        // Cek apakah login sebagai admin (tabel users)
        $user = $userModel->where('username', $usernameOrNIM)->first();
        if ($user && password_verify($password, $user['password'])) {
            $session->set([
                'user_id' => $user['id'],
                'username' => $user['username'],
                'role' => $user['role'],
                'logged_in' => true,
            ]);
            return redirect()->to('/admin/dashboard');
        }

        // Cek apakah login sebagai mahasiswa (tabel mahasiswa)
        $mahasiswa = $mahasiswaModel->where('NIM', $usernameOrNIM)->first();