app/Controllers/Student.php

SELECT *
FROM `courses`
SELECT `c`.`id`, `c`.`title`, `c`.`description`, `c`.`sks`, `e`.`id` as `enrollment_id`
FROM `enrollments` `e`
JOIN `courses` `c` ON `c`.`id` = `e`.`course_id`
WHERE `e`.`user_id` = '1'
---
    public function courses()
    {
        $courseModel = new CourseModel();
        $enrollmentModel = new EnrollmentModel();
        $db = Database::connect();

        $userId = session()->get('user_id');

        // Semua courses dengan SKS
        $allCourses = $courseModel->findAll();

        // Course yang sudah diambil mahasiswa ini
        $takenCourses = $db->table('enrollments e')
            ->select('c.id, c.title, c.description, c.sks, e.id as enrollment_id')
            ->join('courses c', 'c.id = e.course_id')
            ->where('e.user_id', $userId)
            ->get()->getResultArray();

SELECT *
FROM `enrollments`
WHERE `id` = '11'
AND `user_id` = '1'
 LIMIT 1
DELETE FROM `enrollments`
WHERE `id` IN ('11')
---
    public function deleteEnroll($enrollmentId)
    {
        $userId = session()->get('user_id');
        $enrollmentModel = new EnrollmentModel();

        $enrollment = $enrollmentModel->where('id', $enrollmentId)->where('user_id', $userId)->first();

        if ($enrollment) {
            $enrollmentModel->delete($enrollmentId);

SELECT *
FROM `enrollments`
WHERE `user_id` = '1'
INSERT INTO `enrollments` (`user_id`, `course_id`) VALUES ('1', '6')
---
    public function enrollMultiple()
    {
        $enrollmentModel = new EnrollmentModel();
        $userId = session()->get('user_id');
        $selectedCourses = $this->request->getPost('courses');

        if (empty($selectedCourses)) {
            return redirect()->to('/student/courses')->with('error', 'Pilih setidaknya satu course!');
        }

        $courseModel = new CourseModel();
        $db = Database::connect();
        $existingEnrollments = $db->table('enrollments')
            ->where('user_id', $userId)
            ->get()->getResultArray();

        $existingCourseIds = array_column($existingEnrollments, 'course_id');

        foreach ($selectedCourses as $courseId) {
            if (!in_array($courseId, $existingCourseIds)) {
                $enrollmentModel->insert([
                    'user_id' => $userId,
                    'course_id' => $courseId
                ]);